package com.example.dalniapp

import android.content.Context
import android.content.Intent
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import android.widget.TextView
import androidx.core.content.ContextCompat.startActivity
import androidx.recyclerview.widget.RecyclerView
import com.firebase.ui.database.FirebaseRecyclerAdapter
import com.firebase.ui.database.FirebaseRecyclerOptions

class suggestion_adapter (xx: FirebaseRecyclerOptions<suggestion_tict>, val context: Context) :
    FirebaseRecyclerAdapter<suggestion_tict, suggestion_adapter.myviewholder>(xx)  {

    private var sug:HashMap<String,String>?=null


    override fun onCreateViewHolder(parent: ViewGroup, viewType: Int): myviewholder {
        val view = LayoutInflater.from(parent.context).inflate(R.layout.suggestion_card, parent, false)

         sug=HashMap<String,String>()
        sug?.put("تسجيل واقعة ولادة مضى على حدوثها أكثر من سنة (قيد ولادة ) واصدارالشهادة الخاصة بها","تسجيل واقعة ولادة واصدار شهادة ولادة")
        sug?.put("تسجيل واقعة ولادة واصدار شهادة ولادة","تسجيل واقعات الزواج وإصدار الشهادات الخاصة بها")
        sug?.put("تسجيل واقعات الزواج وإصدار الشهادات الخاصة بها","تسجيل واقعات الطلاق وإصدار الشهادات الخاصة بها")
        sug?.put("الحصول على دفتر عائلة بدل فاقد/ بدل تالف","تسجيل الأسرة الاردنية بالسجل المدني والحصول على دفتر عائلة لأول مرة")
        sug?.put("تسجيل واقعات الطلاق وإصدار الشهادات الخاصة بها","تسجيل واقعة وفاة")
        sug?.put("تغيير مكان الإقامة","اصدار جواز سفر بدل فاقد")
        sug?.put("تسجيل واقعة وفاة","الإضافة على جواز السفر‏")
        sug?.put("منح الجنسية الأردنية لزوجات الاردنيين","تسجيل واقعة ولادة مضى على حدوثها أكثر من سنة (قيد ولادة ) واصدارالشهادة الخاصة بها")
        sug?.put("تسجيل الأسرة الاردنية بالسجل المدني والحصول على دفتر عائلة لأول مرة","منح الجنسية الأردنية لزوجات الاردنيين")
        sug?.put("الحصول على دفتر عائلة لأول مرة للمسجلين مدنياً","تسجيل الأسرة الاردنية بالسجل المدني والحصول على دفتر عائلة لأول مرة")
      //10
        sug?.put("الإضافة على جواز السفر‏","تجديد جواز السفر الدائم")
        sug?.put("اصدار جواز سفر بدل فاقد","الإضافة على جواز السفر‏")
        sug?.put("اصدار جواز سفر لمهمة","اصدار جواز سفر بدل فاقد")
        sug?.put("تجديد جواز السفر الدائم","اصدار جواز سفر لمهمة")
        sug?.put("اصدار رخصة إستيراد / جديد","معاملات استبدال الرخص للأردنيين")
        sug?.put("احتساب القيمة المضافة للمنتجات الصناعية الاردنية/ جديد","اصدار رخصة إستيراد / جديد")
        sug?.put("ترخيص مكاتب استقدام واستخدام العاملين في المنازل من غير الاردنيين/جديد","تجديد اصدار تأشيرة عمل للعمال / خادمات المنازل بعد انتهاء صلاحيتها")
        sug?.put("اعادة فتح المنشآت التي تم إغلاقها لمخالفتها لقانون العمل/ جديد","طلب الغاء تسفير العمال الوافدين‏/ مقابل غرامة مالية")
        sug?.put("اعادة فتح المنشآت التي تم إغلاقها لمخالفتها لقانون العمل","طلب الغاء تسفير العمال الوافدين‏/ مقابل غرامة مالية")
        sug?.put("فتح ونقل مراكز تدريب السواقة","معاملات اعادة العمل برخص القيادة والتـي تم وقف العمل بها لاسباب قضائية")
        // 20
        sug?.put("معاملات استبدال الرخص للأردنيين","معاملات اعادة العمل برخص القيادة والتـي تم وقف العمل بها لاسباب قضائية")
        sug?.put("معاملات اعادة العمل برخص القيادة والتـي تم وقف العمل بها لاسباب قضائية","معاملات استبدال الرخص للأردنيين")
        sug?.put("معاملات الدراجات الآلية والسكوترات والمركبات ذات الاستخدام الخاص","معاملات اعادة العمل برخص القيادة والتـي تم وقف العمل بها لاسباب قضائية")
        sug?.put("معاملات منح وتجديد الرخص العمومية المؤقتة والانشائية","فتح ونقل مراكز تدريب السواقة")
        sug?.put("منح شهادة مزاولة معالجة حكمية / معالج طبيعي","التدريب في مجال الفحوصات المخبرية")
        sug?.put("منح اذن الاقامة للمستثمر أو تجديدها","طلب الحصول على إعفاء من رسوم تصريح العمل")
        sug?.put("طلب الحصول على تأشيرات السفر من السفارات المعتمدة لدى البلاط الملكي الهاشمي","التسجيل في دورة تدريبية في مجال الفنون التشكيلية (الرسم، الخزف، الجرافيك، تاريخ الفن، علم الجمال، الخط والزخرفة)")
        sug?.put("طلب الحصول على إعفاء من رسوم تصريح العمل","منح اذن الاقامة للمستثمر أو تجديدها")
        sug?.put("طلب الغاء تسفير العمال الوافدين‏/ مقابل غرامة مالية","اخلاء سبيل العامل الوافد / تكفيل")
        sug?.put("اخلاء سبيل العامل الوافد / تكفيل","طلب الغاء تسفير العمال الوافدين‏/ مقابل غرامة مالية")
        //30
        sug?.put("منح إذن تشغيل للعاملين على إعادة تدوير النفايات الخطرة","اصدار رخصة إستيراد / جديد")
        sug?.put("الموافقة على استيراد الزيوت المعدنية المستهلكة","اصدار رخصة إستيراد / جديد")
        sug?.put("الغاء قرار إبعاد للأجانب","منح اذن الاقامة للمستثمر أو تجديدها")
        sug?.put("استلام اقرارات ضريبة الدخل","كشف بالمبالغ المدفوعة لغايات ضريبة الدخل")
        sug?.put("كشف بالمبالغ المدفوعة لغايات ضريبة الدخل","استلام اقرارات ضريبة الدخل")
        sug?.put("تمويل الشباب العاطلين عن العمل","الحصول على قرض مشروع قائم/ تطوير")
        sug?.put("الإستعلام عن الترتيب التنافسي / الإستعلام عن الإمتحانات التنافسية / الرد على استفسارات المواطنين","التعامل مع الاقتراحات و الشكاوى وحق الحصول على المعلومة المقدمة من متلقي الخدمة و متابعتها")
        sug?.put("الحصول على تصريح زيارة حدث لذويه في مراكز الإصلاح والتأهيل/جديد","الافراج عن المتسولين بكفالة ( ذكور ، اناث)/جديد")
        sug?.put("الافراج عن المتسولين بكفالة ( ذكور ، اناث)/جديد","الحصول على تصريح زيارة حدث لذويه في مراكز الإصلاح والتأهيل/جديد")
        sug?.put("اصدار رخصة تصدير","اصدار رخصة إستيراد / جديد")
        //40
        sug?.put("تسجيل علامة تجارية","تسجيل الأسماء التجارية")
        sug?.put("تسجيل الأسماء التجارية","تسجيل علامة تجارية")
        sug?.put("ترخيص باستعمال الاسم التجاري","التحري عن اسم تجاري لغايات التسجيل")
        sug?.put("التحري عن اسم تجاري لغايات التسجيل","ترخيص باستعمال الاسم التجاري")
        sug?.put("توفيق اوضاع الاسماء التجارية","اصدار رخصة تصدير")
        sug?.put("تسجيل الشركات ذات المسؤولية المحدودة","شطب تسجيل شركة أجنبية عاملة وغير عاملة")
        sug?.put("تسجيل الشركات التي لا تهدف إلى الربح (ذات المسؤولية المحدودة)","شطب تسجيل الشركات ذات المسؤولية المحدودة")
        sug?.put("تسجيل شركة المساهمة (المساهمة العامة والخاصة)","شطب تسجيل الشركات المساهمة العامة / المساهمة الخاصة")
        sug?.put("تجديد اصدار تأشيرة عمل للعمال / خادمات المنازل بعد انتهاء صلاحيتها","ترخيص مكاتب استقدام واستخدام العاملين في المنازل من غير الاردنيين/جديد")
        sug?.put("تسجيل شركة أجنبية عاملة","تسجيل شركة أجنبية غير عاملة")
        //50
        sug?.put("تسجيل شركة أجنبية غير عاملة","تسجيل شركة أجنبية عاملة")
        sug?.put("تسجيل شركات (التضامن، التوصية البسيطة)","شطب تسجيل الشركات المساهمة العامة / المساهمة الخاصة")
        sug?.put("التحويلات التي تتم بين المؤسسين على الأوراق المالية التأسيسية","التحويلات العائلية")
        sug?.put("التحويلات التي تتم تنفيذاً لقرارات التخاصية الصادرة عن مجلس الوزراء","التحويلات التي تتم وفقآ لقرارات المحاكم ودوائر التنفيذ")
        sug?.put("التحويلات التي تتم وفقآ لقرارات المحاكم ودوائر التنفيذ","التحويلات التي تتم تنفيذاً لقرارات التخاصية الصادرة عن مجلس الوزراء")
        sug?.put("التحويلات العائلية","التحويلات التي تتم بين المؤسسين على الأوراق المالية التأسيسية")
        sug?.put("الاستعلام عن قيود الملكية (الرهن، الحجز، التجميد)","التحويلات التي تتم تنفيذاً لقرارات التخاصية الصادرة عن مجلس الوزراء")
        sug?.put("المطالعة الداخلية و الخدمة المرجعية و الدوريات و مكتبة الطفل","شطب تسجيل الشركات ذات المسؤولية المحدودة")
        sug?.put("الحصول على المعلومة من الكتاب والدورية","شطب تسجيل الشركات ذات المسؤولية المحدودة")
        sug?.put("التسجيل في دورة تدريبية في مجال الفنون التشكيلية (الرسم، الخزف، الجرافيك، تاريخ الفن، علم الجمال، الخط والزخرفة)","الموافقة على نشر مادة إبداعية (مقالة، قصة، نص، دراسة، بحث ،...) في مجلة أفكــار")
       //60
        sug?.put("التسجيل في دورة تدريبية في مجال الفنون التشكيلية (الرسم، الخزف، الجرافيك، تاريخ الفن، علم الجمال، الخط والزخرفة)","الموافقة على نشر مادة (مقالة، قصة، نص، دراسة، بحث ،...) في مجلة الفنون الشعبية")
        sug?.put("برنامج التدريب العملي على نظام التداول الالكتروني","تعديل رأس المال")
        sug?.put("التدريب على البرامج الإدارية","التدريب على برامج اللغة الإنجليزية")
        sug?.put("التدريب على برامج اللغة الإنجليزية","التدريب على البرامج الإدارية")
        sug?.put("التدريب المتخصص القضاة والحقوقيون والإداريون من غير الأردنيين.‏","‏التدريب في مختلف مجالات التميز والجودة والإدارة‏")
        sug?.put("‏التدريب في مختلف مجالات التميز والجودة والإدارة‏","التدريب المتخصص القضاة والحقوقيون والإداريون من غير الأردنيين.‏")
        sug?.put("اصدار شهادات (بدل تالف-فاقد، كشف علامات،ترجمة)","تدقيق الشهادات (مصدقة، كشف علامات، إثبات طالب)")
        sug?.put("برنامج تدريب مستوى","التدريب على البرامج الإدارية")
        sug?.put("الموافقة على نشر مادة إبداعية (مقالة، قصة، نص، دراسة، بحث،...) في مجلة وسـام","اهـــداء الكتـــب")
        sug?.put("الموافقة على نشر مادة (مقالة، قصة، نص، دراسة، بحث ،...) في مجلة الفنون الشعبية","اهـــداء الكتـــب")
        //70
        sug?.put("الموافقة على نشر مادة إبداعية (مقالة، قصة، نص، دراسة، بحث ،...) في مجلة أفكــار","التسجيل في دورة تدريبية في مجال الفنون التشكيلية (الرسم، الخزف، الجرافيك، تاريخ الفن، علم الجمال، الخط والزخرفة)")
        sug?.put("التسجيل في الدورة التدريبية في مجال الموسيقى تشمل آلات (العود، الجيتار، الكمان، البيانو، الناي، الإيقاع، القانون)","التسجيل في دورة تدريبية في مجال الفنون التشكيلية (الرسم، الخزف، الجرافيك، تاريخ الفن، علم الجمال، الخط والزخرفة)")
        sug?.put("التدريب في مجال الفحوصات المخبرية","منح شهادة مزاولة معالجة حكمية / معالج طبيعي")
        sug?.put("التعامل مع الاقتراحات و الشكاوى وحق الحصول على المعلومة المقدمة من متلقي الخدمة و متابعتها","الإستعلام عن الترتيب التنافسي / الإستعلام عن الإمتحانات التنافسية / الرد على استفسارات المواطنين")
        sug?.put("الحصول على قبول للدراسة في الجامعات الأردنية الرسمية والخاصة للطلبة الوافدين من خارج الأردن","تقدير المعدل لحملة الشهادات العلمية غير الأردنية لمختلف المستويات الأكاديمية")
        sug?.put("تعديل رأس المال","طلب الحصول على إعفاء من رسوم تصريح العمل")
        sug?.put("تدقيق الشهادات (مصدقة، كشف علامات، إثبات طالب)","تصديق شهادة دبلوم تدريبي/ دورة")
        sug?.put("تصديق شهادة دبلوم تدريبي/ دورة","تدقيق الشهادات (مصدقة، كشف علامات، إثبات طالب)")
        sug?.put("تعديل بيانات طلبة الجامعات الأردنية الخاصة على نظام مؤسسات التعليم العالي","تقدير المعدل لحملة الشهادات العلمية غير الأردنية لمختلف المستويات الأكاديمية")
        sug?.put("تقدير المعدل لحملة الشهادات العلمية غير الأردنية لمختلف المستويات الأكاديمية","تعديل بيانات طلبة الجامعات الأردنية الخاصة على نظام مؤسسات التعليم العالي")
       //80
        sug?.put("الاستعلام عن كشوفات الحسابات والأرصدة","التحويلات العائلية")
        sug?.put("خدمة توفير التمويل للمشاريع التنموية","طلب الحصول على إعفاء من رسوم تصريح العمل")
        sug?.put("الحصول على قرض مشروع قائم/ تطوير","فتح ملف ضريبي جديد")
        sug?.put("شطب السجل التجاري","شطب الاسماء التجارية")
        sug?.put("شطب الاسماء التجارية","شطب السجل التجاري")
        sug?.put("طلب الغير شطب الاسم التجاري","شطب السجل التجاري")
        sug?.put("انسحاب بالإرادة المنفردة لشركات التضامن والتوصية البسيطة","شطب تسجيل الشركات المساهمة العامة / المساهمة الخاصة")
        sug?.put("تصفية الشركات المساهمة العامة, المساهمة الخاصة, معفاة(مساهمة خاصة), لا تهدف إلى الربح (مساهمة خاصة)","شطب تسجيل الشركات ذات المسؤولية المحدودة")
        sug?.put("اغلاق دار حضانة بناء على رغبة المؤسسين","شطب وإلغاء رخصة المهن")
        sug?.put("الغاء عقد الايجار","شطب وإلغاء رخصة المهن")
        //90
        sug?.put("شطب وإلغاء رخصة المهن","تعديل رأس المال")
        sug?.put("شطب تسجيل الشركات ذات المسؤولية المحدودة","تسجيل الشركات التي لا تهدف إلى الربح (ذات المسؤولية المحدودة)")
        sug?.put("شطب تسجيل الشركات المساهمة العامة / المساهمة الخاصة","تسجيل شركة المساهمة (المساهمة العامة والخاصة)")
        sug?.put("شطب تسجيل شركة أجنبية عاملة وغير عاملة","تسجيل الشركات ذات المسؤولية المحدودة")
        sug?.put("اعداد التقارير المالية","تعديل رأس المال")
        sug?.put("فتح ملف ضريبي جديد","الحصول على قرض مشروع قائم/ تطوير")
        sug?.put("اصدار رخصة مزاولة النشاط الاستثماري","منح اذن الاقامة للمستثمر أو تجديدها")
        sug?.put("الحصول على إذن إشغال","الحصول على المياه")
        sug?.put("الحصول على المياه","الحصول على إذن إشغال")
        sug?.put("الحصول على خدمات الإتصالات","الحصول على إذن إشغال")


        return myviewholder(view)
    }

    override fun onBindViewHolder(holder: myviewholder, position: Int, model: suggestion_tict) {



if (sug?.get(model.name.toString()) !=null)
{


    holder.name3.text=sug?.get(model.name.toString())
}else{

    holder.name3.text = model.name
}




holder.itemView.setOnClickListener {
    var intent: Intent = Intent(context, SearchActivity::class.java)
    //  var bundle = Bundle()

    intent.putExtra("searchString", holder.name3.text.toString())
    context.startActivity(intent)

}
    }





    class myviewholder(itemView: View) : RecyclerView.ViewHolder(itemView) {
        var name3 = itemView.findViewById(R.id.txt1_sug) as TextView
       // var date1 = itemView.findViewById(R.id.txt2_sug) as TextView

    }

}

